@echo off
chcp 65001 >nul
title Κέντρο Αεροπορικής Ιατρικής - Διακομιστής
echo ========================================================
echo         ΚΕΝΤΡΙΚΟΣ SERVER ΕΦΑΡΜΟΓΗΣ K.A.I.
echo ========================================================
echo.

for /f "tokens=14" %%a in ('ipconfig ^| findstr IPv4') do set MY_IP=%%a

echo [ΟΔΗΓΙΕΣ ΠΡΟΣΒΑΣΗΣ]
echo Για εσάς (στον ίδιο υπολογιστή): https://localhost
echo Για τους υπόλοιπους (στο δίκτυο): https://%MY_IP%
echo.
echo ========================================================
echo Εκκίνηση Docker (Παρακαλώ περιμένετε...)
docker-compose up -d --build

echo.
echo Το σύστημα λειτουργεί! Μπορείτε να ελαχιστοποιήσετε αυτό το παράθυρο.
pause