@echo off
chcp 65001 >nul
title Κέντρο Αεροπορικής Ιατρικής - Ασφαλής Τερματισμός
echo ========================================================
echo        ΑΣΦΑΛΗΣ ΤΕΡΜΑΤΙΣΜΟΣ ΔΙΑΚΟΜΙΣΤΗ K.A.I.
echo ========================================================
echo.
echo Παρακαλώ περιμένετε... Γίνεται ασφαλής αποθήκευση δεδομένων
echo και τερματισμός της Βάσης Δεδομένων (PostgreSQL).
echo.
docker-compose down

echo.
echo ========================================================
echo Το σύστημα τερματίστηκε με απόλυτη ασφάλεια! 
echo Μπορείτε να κλείσετε το PC.
echo ========================================================
pause